about_image.text=
#NOI18N
about_image.icon=splash.png
tabs.AccessibleContext.accessibleName=e-lab
jTextPaneME.contentType=text/html
jTextPaneIST.contentType=text/html
jTextPaneLinkare.contentType=text/html
jTextPaneLicence.contentType=text/html
jScrollPaneME.TabConstraints.tabTitle=Sobre a DGIDC e o ME
jScrollPaneIST.TabConstraints.tabTitle=Sobre o IST
jScrollPaneLinkare.TabConstraints.tabTitle=Sobre a Linkare
jScrollPaneLicence.TabConstraints.tabTitle=Direitos de autor
jScrollPaneElab.TabConstraints.tabTitle=e-lab
jTextPaneME.text=<html>\n  <head>\n\n  </head>\n  <body>\n\n<h3>Sobre a DGIDC e o ME</h3>\n<p>\nA DGIDC tem por miss\u00E3o assegurar a concretiza\u00E7\u00E3o das pol\u00EDticas relativamente \u00E0 componente pedag\u00F3gica e did\u00E1ctica da educa\u00E7\u00E3o pr\u00E9-escolar, dos ensinos b\u00E1sico e secund\u00E1rio e da educa\u00E7\u00E3o extra-escolar, nomeadamente no que se refere a \u201Cconceber, desenvolver, concretizar e avaliar iniciativas mobilizadoras e integradoras no dom\u00EDnio do uso das tecnologias e dos recursos educativos digitais nas escolas e nos processos de ensino-aprendizagem, designadamente a promo\u00E7\u00E3o e disponibiliza\u00E7\u00E3o dos recursos educativos digitais\u201D.\n</p>\n<p>\nO Minist\u00E9rio da Educa\u00E7\u00E3o atrav\u00E9s da DGIDC \u00E9 respons\u00E1vel pelo financiamento do projecto-piloto do <i><strong>e-lab b\u00E1sico</strong></i>, dirigido a alunos e docentes de Ci\u00EAncias F\u00EDsicas e Naturais do 3\u00BA Ciclo do Ensino B\u00E1sico e Secund\u00E1rio, com o objectivo de valorizar de forma crescente o trabalho experimental nas escolas portuguesas. \n</p>\n<p>\nA DGIDC mant\u00E9m um s\u00EDtio no Moodle de apoio ao projecto piloto. Mais informa\u00E7\u00F5es em <a href\="http\://moodle.crie.min-edu.pt/">http\://moodle.crie.min-edu.pt/</a>\n</p>\n\n  </body>\n</html>\n
jTextPaneIST.text=<html>\n  <head>\n\n  </head>\n  <body>\n\n<h3>Sobre o IST</h3>\n<p>\nO Instituto Superior T\u00E9cnico (IST) tem como miss\u00E3o contribuir para o desenvolvimento da sociedade, promovendo um ensino de excel\u00EAncia e qualidade nas \u00E1reas da ci\u00EAncia e tecnologia, desenvolvendo actividades de Investiga\u00E7\u00E3o e Desenvolvimento essenciais para ministrar um ensino ao n\u00EDvel dos mais elevados padr\u00F5es internacionais.\n</p>\n<p>\nO Departamento de F\u00EDsica do IST possui um <i>e-lab</i> com um conjunto diversificado de experi\u00EAncias. Algumas destas experi\u00EAncias s\u00E3o disponibilizadas e mantidas para o e-lab b\u00E1sico.\n</p>\n<p>\nO departamento de F\u00EDsica do IST \u00E9 igualmente respons\u00E1vel pela cria\u00E7\u00E3o das experi\u00EAncias integradas no e-lab, pela cria\u00E7\u00E3o e publica\u00E7\u00E3o dos respectivos conte\u00FAdos de apoio aos professores e alunos e pela forma\u00E7\u00E3o dos professores envolvido neste projecto-piloto.\n</p>\n<p>\nMais informa\u00E7\u00F5es em <a href\="www.fisica.ist.utl.pt">www.fisica.ist.utl.pt</a> ou <a href\="www.e-escola.pt">www.e-escola.pt</a>.\n</p>\n\n  </body>\n</html>\n
jTextPaneLinkare.text=<html>\n  <head>\n\n  </head>\n  <body>\n<h3>Sobre a Linkare TI</h3>\n<p>\nFundada em 2004, a Linkare TI apresenta-se como especialista na presta\u00E7\u00E3o de servi\u00E7os e na oferta de solu\u00E7\u00F5es sobre tecnologia Java (JSE, JEE e JME), dirigidas a empresas nos diferentes sectores de actividade, organiza\u00E7\u00F5es e administra\u00E7\u00E3o p\u00FAblica, com particular destaque no sector da Educa\u00E7\u00E3o. \n</p>\n<p>\nA Linkare TI foi a empresa escolhida pelo IST para desenvolver o e-lab do ME, implementado sobre a plataforma <i>ReC \u2013 Remote Experienced Control</i>.\n</p>\n<p>\nMais informa\u00E7\u00F5es em <a href\="www.linkare.pt">www.linkare.pt</a>\n</p>\n  </body>\n</html>\n
jTextPaneLicence.text=<html>\n  <head>\n\n  </head>\n  <body>\n\n<h3>Direitos de autor\:</h3>\n<ol>\n<li>\nToda a documenta\u00E7\u00E3o, experi\u00EAncias (hardware e software) criados pelo segundo IST no \u00E2mbito deste projecto-piloto, s\u00E3o co-propriedade do ME e do IST.\n</li>\n<li>\nExceptua-se do direito de propriedade do ME, as metodologias, Know-how, produtos e software desenvolvidos anteriormente pelo IST e que s\u00E3o utilizados neste projecto-piloto.\n</li>\n<li>\nExceptua-se do direito de propriedade do ME e do IST os direitos sobre o software e outros produtos de terceiros utilizados no presente projecto-piloto e que sejam objecto de contrato de licenciamento, nomeadamente\:\n</li>\n<li>\n<ol>\n<li>\nPlataforma de aquisi\u00E7\u00E3o de dados e controlo remoto ReC \u2013 Remote Experienced Control ReC, da empresa Linkare TI;\n</li>\n<li>\nPlataforma de gest\u00E3o de aloca\u00E7\u00F5es e metainforma\u00E7\u00E3o de laborat\u00F3rio e experi\u00EAncias ReC.Web \u2013 da empresa Linkare TI;\n</li>\n<li>\nCommunity OpenOrb \u2013 Implementa\u00E7\u00E3o de um ORB (Object Request Broker) compat\u00EDvel com a especifica\u00E7\u00E3o de CORBA 2.3 (Common Object Request Broker Architecture) em Java \u2013 da comunidade de c\u00F3digo aberto OpenOrb, e regulada pela licen\u00E7a OpenORB Community Software Licence (http\://openorb.sourceforge.net/license.txt)\n</li>\n<li>\nJFreeChart \u2013 Biblioteca de desenho de gr\u00E1ficos em Java \u2013 da comunidade de c\u00F3digo aberto www.jfree.org e financiada pela empresa Object Refinery Limited,  regulada pela licen\u00E7a de c\u00F3digo aberto LGPL (Lesser General Public Licence http\://www.gnu.org/licenses/lgpl.html)\n</li>\n<li>\nJCommons \u2013 Biblioteca de suporte (http\://jcommons.sourceforge.net/), utilizada no suporte a JFreeChart, e regulada pela licen\u00E7a de c\u00F3digo aberto GPL (Gnu Public License http\://www.gnu.org/licenses/gpl-2.0.html)\n</li>\n<li>\nVLC\n</li>\n<li>\nJVLC\n</li>\n<li>\nJNA \u2013 Biblioteca de suporte a integra\u00E7\u00E3o com bibliotecas nativas de plataforma a partir de Java (https\://jna.dev.java.net/), regulada pela licen\u00E7a LGPL (Lesser General Public Licence http\://www.gnu.org/licenses/old-licenses/lgpl-2.1.html)\n</li>\n<li>\nAvalon \u2013 Framework de suporte de componentes e containers, fazendo uso de padr\u00F5es como IOC (Inversion Of Control) e SOC (Separation of Concerns) da Apache Software Foundation e regulada pela licen\u00E7a Apache Software Licence (http\://archive.apache.org/dist/avalon/LICENSE.txt)\n</li>\n<li>\nFITS\n</li>\n<li>\nXerces\n</li>\n<li>\nAppFramework\n</li>\n<li>\nRXTX\n</li>\n<li>\nLogKit\n</li>\n<li>\ncommons-logging\n</li>\n</ol>\n</ol>\n\n  </body>\n</html>\n
jScrollPaneSobreElab.TabConstraints.tabTitle=Sobre o e-lab
jTextPaneSobreElab.contentType=text/html
jTextPaneSobreElab.text=<html>\n  <head>\n\n  </head>\n  <body>\n\n<h3>Sobre o e-lab</h3>\n<p>\nO e-lab permite aos seus utilizadores acederem a um laborat\u00F3rio real online, via Internet, controlarem remotamente uma montagem experimental, receberem e partilharem os dados da experi\u00EAncia visualizando a imagem da experi\u00EAncia a decorrer em tempo real e, ainda, conversar numa sala de chat com os restantes utilizadores do laborat\u00F3rio.\n</p>\n\n  </body>\n</html>\n
